print("Добре дошъл в моята игра!😋")
name = input("Как се казваш? ")
age = int(input("На колко години си? "))

health = 10

if age >= 18:
    print("Достатъчно голям си, за да играем!🧔")

    wants_to_play = input("Искаш ли да играем? ").lower()
    if wants_to_play == "да":
        print("Започваш с", health, "точки за здраве")
        print("Хайде да играем!")

        left_or_right = input("Първи избор... Ляво или Дясно (ляво/дясно)? ")
        if left_or_right == "ляво":
            ans = input("""На ляво има пътека към хълм🚵🏻‍♀️. Ще минеш през него🧗‍♂️ или ще заобиколиш🚵‍♀️
            (през него/заобикалям)? """)

            if ans == "заобикалям":
                print("Заобикали го и стигна от другата страна.")
            elif ans == "през него":
                print("Мина, но на върха на хълма имаше вълк - той те нападна и загуби 5 точки от твоето здраве.")
                health -= 5

            ans = input("Забелязваш къщурка и гора. Къде ще поемеш (гората/къщата)? ")
            if ans == "къщата":
                print("Посреща те собственикът... Ти си неканен гост и определено не те харесва💪🏾 - губиш  5 точки здраве")
                health -= 5

                if health <= 0:
                    print("Тъжно, ти остана с 0 точки здраве...губиш играта!")
                else:
                    print("Но оцеля до края... ПЕЧЕЛИШ!")

            else:
                print("В гората имаше блато, потъна в плавашите пясъщи и загуби...")


        else:
            print("Падна в пропаст и загуби...")

    else:
        print("Чао...")
else:
    print("Не може да играем, нямаш нужните години👨🏼‍🌾...")
